# SQL

In [6]:
import pandas as pd
import requests
import getpass
import mysql.connector
import getpass

In [11]:
data = pd.read_csv('data_2020.csv')
data_pred_2020 = pd.read_csv('climate_pred_2020.csv')
data_pred_2019 = pd.read_csv('climate_pred_2019.csv')
data_pred_2018 = pd.read_csv('climate_pred_2018.csv')

In [12]:
data.drop(columns=['Unnamed: 0'],inplace=True)
data_pred_2020.drop(columns=['Unnamed: 0'],inplace=True)
data_pred_2019.drop(columns=['Unnamed: 0'],inplace=True)
data_pred_2018.drop(columns=['Unnamed: 0'],inplace=True)

In [13]:
data.head()

,country,year,CDA,CHA,FGA,NDA,BCA
0,Albania,1995,100.000000,73.072520,0.000000,78.221486,100.000000
1,Algeria,1995,40.836434,98.636534,96.334651,72.620891,70.996796
2,Angola,1995,12.888007,70.729875,0.000000,100.000000,43.865361
3,Antigua and Barbuda,1995,44.483927,80.575637,0.000000,36.690524,68.683208
4,Argentina,1995,40.485271,100.000000,100.000000,63.435774,45.942816

In [14]:
cnx = mysql.connector.connect(user='admin', password=getpass.getpass(), 
                              host='ironhack-bootcamp.cfayyzobwby9.eu-west-2.rds.amazonaws.com',
                              database='final_project',use_pure=True)

In [15]:
if cnx.is_connected():
    print('You are connected to the databse')
else:
    print('Connection is not open')

You are connected to the databse

In [16]:
# we need to define the object we will use to interact with the database
cursor = cnx.cursor()

In [8]:
# simple querry to create a table in ironhack_personell database named 'names' with three columns (studens, age, school):

    ### ALSO CHECK IF YOUR QUERIES WERE WELL DONE ###
    
#querry = ("CREATE TABLE IF NOT EXISTS "
#"data_2020 ("
#"country VARCHAR(50) PRIMARY KEY ,"
#"year VARCHAR(8),"
#"CDA FLOAT,"
#"CHA FLOAT,"
#"FGA FLOAT,"
#"NDA FLOAT,"
#"BCA FLOAT)")

In [17]:
# this line executes the above querry to create an empty table in MySQL
#cursor.execute(querry)

NameError: name 'querry' is not defined

In [18]:
from sqlalchemy import create_engine
import pymysql

In [19]:
# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@ironhack-bootcamp.cfayyzobwby9.eu-west-2.rds.amazonaws.com/{db}"
                       .format(user="admin",
                               pw=getpass.getpass(),
                               db="final_project"))

#data to upload
#querry = data.to_sql('data', con = engine, if_exists = 'append', index = False)
data.to_sql('climate', con = engine, if_exists = 'append', index = False)
data_pred_2020.to_sql('climate_pred2020', con = engine, if_exists = 'append', index = False)
data_pred_2019.to_sql('climate_pred2019', con = engine, if_exists = 'append', index = False)
data_pred_2018.to_sql('climate_pred2018', con = engine, if_exists = 'append', index = False)

In [20]:
cursor.execute(querry)

NameError: name 'querry' is not defined

In [21]:
# saving any changes you did on the database
#cnx.commit()
# clear the cursor
cursor.close()
# closes the door between python and SQL
cnx.close()